# web - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.random_password.nextauthsecret: Refreshing state... [id=none]
module.common_resources.data.vercel_project_directory.default: Reading...
module.common_resources.data.vercel_project_directory.default: Read complete after 0s [id=../../../]
module.common_resources.data.aws_apigatewayv2_apis.connect_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.organization_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.identity_api_api_gateway_id: Reading...
module.common_resources.data.aws_cognito_user_pools.user_pool: Reading...
module.common_resources.data.aws_apigatewayv2_apis.gateway_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.customer_api_api_gateway_id: Reading...
module.common_resources.data.aws_cognito_user_pools.user_pool: Read complete after 1s [id=production]
module.common_resources.data.aws_apigatewayv2_apis.gateway_api_api_gateway_id: Read complete after 1s [id=us-east-1]
module.common_resources.aws_cognito_user_pool_client.default: Refreshing state... [id=4b40ic65moeoot7qjmf7arsun3]
module.common_resources.data.aws_apigatewayv2_apis.organization_api_api_gateway_id: Read complete after 1s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.gateway_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_api.organization_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_apis.customer_api_api_gateway_id: Read complete after 1s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.customer_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_apis.identity_api_api_gateway_id: Read complete after 1s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.identity_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_apis.connect_api_api_gateway_id: Read complete after 1s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.connect_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_api.gateway_api_api_gateway: Read complete after 0s [id=l09k6gy1lf]
module.common_resources.data.aws_apigatewayv2_api.identity_api_api_gateway: Read complete after 0s [id=c87otdqh8g]
module.common_resources.data.aws_apigatewayv2_api.organization_api_api_gateway: Read complete after 0s [id=lfdgjp94z7]
module.common_resources.data.aws_apigatewayv2_api.customer_api_api_gateway: Read complete after 0s [id=1sv926z3fc]
module.common_resources.data.aws_apigatewayv2_api.connect_api_api_gateway: Read complete after 0s [id=psvw6s5edb]
module.common_resources.vercel_project.default: Refreshing state... [id=prj_BJCb1oYIBA9lcQGSZ9FPrDahWRRN]
module.common_resources.vercel_project_domain.default: Refreshing state... [id=new-production.connectilly.com]
module.common_resources.vercel_deployment.default: Refreshing state... [id=dpl_45nAss4LFYWvHsPNxPa7sFF4HbnD]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.common_resources.vercel_deployment.default must be replaced
-/+ resource "vercel_deployment" "default" {
      ~ domains     = [ # forces replacement
          - "new-production.connectilly.com",
          - "production-web-nine.vercel.app",
          - "production-web-connectilly.vercel.app",
          - "production-web-mortezaconnectilly-connectilly.vercel.app",
        ] -> (known after apply) # forces replacement
      ~ files       = { # forces replacement
          ~ "../../../infrastructure/workspaces/common_resources/resources.tf"                                = "5330~d50f48d1eeb1201fdd0073aa902420b0392da25c" -> "5909~6654a742d7f831c188a58bbf9487e67d28fafead"
          ~ "../../../package.json"                                                                           = "1373~a3047023c5dca63cb5fc2a86ab63282a723a752b" -> "1373~277a602852a5d1340ce1b8de5c01d3450b1ac7cf"
          ~ "../../../src/clients/generate.go"                                                                = "732~3d203ae00d8d1cf4a4bec421590828f6c0077664" -> "965~5c298facc60fbdb0a539a55a446209daa80e00ca"
          + "../../../src/clients/openapi/connectilly/connect/v1/fetch/ConnectillyConnectClient.ts"           = "1294~dfd71b42b794b25c35addca681327ca474ef9fec"
          + "../../../src/clients/openapi/connectilly/connect/v1/fetch/core/ApiError.ts"                      = "740~945196ea0e768d9ce2f1c5ac0d2c09eda0e1243e"
          + "../../../src/clients/openapi/connectilly/connect/v1/fetch/core/ApiRequestOptions.ts"             = "577~2013bd376f0bde815ee25ab65383981725281f1e"
          + "../../../src/clients/openapi/connectilly/connect/v1/fetch/core/ApiResult.ts"                     = "236~a917641eaa2e615a77ff60fa178c927f2ed5b717"
          + "../../../src/clients/openapi/connectilly/connect/v1/fetch/core/BaseHttpRequest.ts"               = "426~d7936ef7b172d50a019264c3b1d2edaf24ae9c78"
          + "../../../src/clients/openapi/connectilly/connect/v1/fetch/core/CancelablePromise.ts"             = "3963~f61c713e20b332582e97f232f66bfd0bfc8fc322"
          + "../../../src/clients/openapi/connectilly/connect/v1/fetch/core/FetchHttpRequest.ts"              = "770~35e2a358f2852952e7d94f4f32ad1de66b36a8b2"
          + "../../../src/clients/openapi/connectilly/connect/v1/fetch/core/OpenAPI.ts"                       = "862~a2bebc6da3500167296110575eb5c3d137ceed61"
          + "../../../src/clients/openapi/connectilly/connect/v1/fetch/core/request.ts"                       = "9539~d60f0515ee2c147d3ea3eabe070e422452f88275"
          + "../../../src/clients/openapi/connectilly/connect/v1/fetch/index.ts"                              = "616~630096ab3d1e4050617d9b115ac61d2b978be6cd"
          + "../../../src/clients/openapi/connectilly/connect/v1/fetch/models/Error.ts"                       = "206~7821983fd3495ed999afe759d81c5f85fea3ac9f"
          + "../../../src/clients/openapi/connectilly/connect/v1/fetch/schemas/$Error.ts"                     = "413~26f5fee7acee4a18c4ceca4e6f5d9141a7ade0ef"
          + "../../../src/clients/openapi/connectilly/connect/v1/fetch/services/ApiService.ts"                = "1028~934859424c8003aec93699206f169098fa3014a0"
          + "../../../src/clients/openapi/connectilly/connect/v1/fetch/services/ConnectService.ts"            = "1032~c3fba60a62f4354a99e3471265f54bd643583918"
          ~ "../../../src/types/environment.d.ts"                                                             = "354~f96a483839a0118937c98b3b75896bbc9d65f9f4" -> "386~efd7bd460648e72bf13d25b844176cfe4ea731ae"
          ~ "../../../yarn.lock"                                                                              = "152646~175637a42ac426aeae5c8d9a9ad4f1e89882840b" -> "152646~c096fa5495872da6e53330441ec46cf8ce1e1896"
            # (90 unchanged elements hidden)
        }
      ~ id          = "dpl_45nAss4LFYWvHsPNxPa7sFF4HbnD" -> (known after apply)
      ~ url         = "production-k1uxdvmoy-connectilly.vercel.app" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.common_resources.vercel_project.default will be updated in-place
  ~ resource "vercel_project" "default" {
      ~ environment                = (sensitive value)
        id                         = "prj_BJCb1oYIBA9lcQGSZ9FPrDahWRRN"
        name                       = "production-web"
      + serverless_function_region = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*